In [1]:
import pandas as pd

In [2]:
ordered_satisfaction=['Very Unhappy','Unhappy','Neutral','Happy',]

In [7]:
df=pd.DataFrame({'satisfaction':['Mad', 'Happy', 'Unhappy', 'Neutral']})

In [9]:
df

  satisfaction
0          Mad
1        Happy
2      Unhappy
3      Neutral

In [16]:
df['satisfaction2']=df.satisfaction.astype(dtype='category',ordered= True, categories=ordered_satisfaction )

/usr/local/lib/python2.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: specifying 'categories' or 'ordered' in .astype() is deprecated; pass a CategoricalDtype instead
  """Entry point for launching an IPython kernel.

In [17]:
df

  satisfaction satisfaction2
0          Mad           NaN
1        Happy         Happy
2      Unhappy       Unhappy
3      Neutral       Neutral

In [18]:
df.dtypes

satisfaction       object
satisfaction2    category
dtype: object

In [19]:
df.satisfaction2=df.satisfaction2.cat.codes

In [20]:
df.satisfaction2

0   -1
1    3
2    1
3    2
Name: satisfaction2, dtype: int8

In [21]:
df=pd.DataFrame({'vertebrates':['Bird','Bird','Mammal',
                               
                            'Fish','Amphibian','Reptile','Mammal']})

In [22]:
df

  vertebrates
0        Bird
1        Bird
2      Mammal
3        Fish
4   Amphibian
5     Reptile
6      Mammal

In [25]:
df['vertebrates2']=df.vertebrates.astype('category').cat.codes

In [26]:
df

  vertebrates  vertebrates2
0        Bird             1
1        Bird             1
2      Mammal             3
3        Fish             2
4   Amphibian             0
5     Reptile             4
6      Mammal             3

In [ ]:
df = pd.get_dummies(df, columns = ['vertebrates'])

In [1]:
from scipy import misc

In [2]:
img = misc.imread('Screenshot from 2017-02-26 12-01-49.png')
type(img)

numpy.ndarray

In [3]:
img.shape

(768, 1366, 4)

In [4]:
img.dtype

dtype('uint8')

In [5]:
img = img[::2, ::2]
img.shape

(384, 683, 4)

In [6]:
img=(img/255).reshape(-1,4)

In [7]:
red=img[:,0]
green=img[:,1]
blue=img[:,2]

In [8]:
gray=0.299*red + 0.587*green + 0.114*blue

In [16]:
img.shape

(65664, 4)

In [17]:
gray.shape

(65664,)

In [16]:
import pandas as pd

In [18]:
df=pd.read_csv("/home/rishabh/Desktop/Data Science/DAT210x-master/Module2/Datasets/tutorial.csv")

In [21]:
df

       col0      col1      col2      col3
0 -0.722876 -1.330682  1.309208  0.232378
1  1.160396 -0.730879  0.677368  1.044722
2 -1.062870 -0.503704 -0.238536 -1.417937
3  0.437078  0.362640 -0.111228 -1.649853

In [22]:
df.describe()

           col0      col1      col2      col3
count  4.000000  4.000000  4.000000  4.000000
mean  -0.047068 -0.550656  0.409203 -0.447672
std    1.029715  0.701720  0.723956  1.300815
min   -1.062870 -1.330682 -0.238536 -1.649853
25%   -0.807875 -0.880830 -0.143055 -1.475916
50%   -0.142899 -0.617291  0.283070 -0.592780
75%    0.617907 -0.287118  0.835328  0.435464
max    1.160396  0.362640  1.309208  1.044722

In [25]:
df.loc[2:4, 'col3']

2   -1.417937
3   -1.649853
Name: col3, dtype: float64